ATsupportum/src/Documents/ВыполнениеЗаявкиНаАрендуОборудования_ат/ВыполнениеЗаявкиНаАрендуОборудования_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеЗаявкиНаАрендуОборудования_ат</name>
  <registerRecords>AccumulationRegister.УчетРесурсовСерверов_ат</registerRecords>
  <attributes>
    <name>ВыделенныйСервер</name>
    <type>
      <types>CatalogRef.Серверы_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>RAM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HDD_ат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Core</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
    </type>
  </attributes>
</mdclass:Document>

ATsupportum/src/Enums/ТипыРесурсов_ат/ТипыРесурсов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРесурсов_ат</name>
  <enumValues>
    <name>RAM</name>
  </enumValues>
  <enumValues>
    <name>HDD_ат</name>
  </enumValues>
  <enumValues>
    <name>Частота</name>
  </enumValues>
  <enumValues>
    <name>Core</name>
  </enumValues>
  <enumValues>
    <name>СозданНаСервере</name>
  </enumValues>
  <enumValues>
    <name>Запущен</name>
  </enumValues>
  <enumValues>
    <name>ФизическийСервер</name>
  </enumValues>
  <enumValues>
    <name>IPv4</name>
  </enumValues>
  <enumValues>
    <name>mask</name>
  </enumValues>
  <enumValues>
    <name>gate</name>
  </enumValues>
  <enumValues>
    <name>dns</name>
  </enumValues>
  <enumValues>
    <name>dns2</name>
  </enumValues>
  <enumValues>
    <name>AdmPass</name>
  </enumValues>
  <enumValues>
    <name>numproc</name>
  </enumValues>
  <enumValues>
    <name>autostart</name>
  </enumValues>
  <enumValues>
    <name>VEID</name>
  </enumValues>
  <enumValues>
    <name>РазрешенаАренда</name>
  </enumValues>
  <enumValues>
    <name>ПроцентИспользованияПроцессора</name>
  </enumValues>
  <enumValues>
    <name>ПроцентИспользованияПамяти</name>
  </enumValues>
  <enumValues>
    <name>ПроцентИспользованияЖесткогоДиска</name>
  </enumValues>
  <enumValues>
    <name>СборСтатистикиWMI</name>
  </enumValues>
  <enumValues>
    <name>СборСтатистикиVZ</name>
  </enumValues>
  <enumValues>
    <name>СборСтатистикиZabbix</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Documents/ВыполнениеЗаявкиНаАрендуОборудования_ат/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетРесурсов_ат Расход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Движение = Движения.УчетРесурсов_ат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер;
	Движение.ВыделенныйСервер = ВыделенныйСервер;
	Движение.Договор = Договор;	
	Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Core;
	Движение.ЗначениеРесурса = Core;

	// регистр УчетРесурсов_ат Расход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Движение = Движения.УчетРесурсов_ат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер;
	Движение.Договор = Договор;	
	Движение.ВыделенныйСервер = ВыделенныйСервер;
	Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.RAM;
	Движение.ЗначениеРесурса = RAM;

	// регистр УчетРесурсов_ат Расход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Движение = Движения.УчетРесурсов_ат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
Если ВыделенныйСервер.ФизическийСервер.Лезвие = Истина тогда
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер.СХД_ат[0].СХД_ат;
Иначе 
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер;
КонецЕсли;
	Движение.ВыделенныйСервер = ВыделенныйСервер;
	Движение.Договор = Договор;
	Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат;
	Движение.ЗначениеРесурса = HDD_ат;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
		Если НЕ ПометкаУдаления = Ссылка.ПометкаУдаления И ПометкаУдаления = истина тогда
		 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры_ат.Ссылка
		|ИЗ
		|	Справочник.Договоры_ат КАК Договоры_ат
		|ГДЕ
		|	Договоры_ат.Основание = &Основание
		|	И Договоры_ат.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Основание", 			ЭтотОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("ПометкаУдаления", 	ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		дог = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект;
		дог.ПометкаУдаления = истина;
		//дог.Записать;
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	конецЕсли;

КонецПроцедуры
